app/controllers/operative_records_controller.rb

  def index
    @operative_records = OperativeRecord.where(user_id: current_user.id).order(:target_day)
---
SELECT "operative_records".* FROM "operative_records" WHERE "operative_records"."user_id" = $1  ORDER BY "operative_records"."target_day" ASC  [["user_id", 1]]

  def show
    @operative_record = OperativeRecord.find(params[:id])
---
SELECT  "operative_records".* FROM "operative_records" WHERE "operative_records"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @operative_record = OperativeRecord.new(operative_record_params)
    @operative_record.user_id = current_user.id
    @operative_record.save
---
INSERT INTO "operative_records" ("target_day", "registry_emergency_count", "dead_count", "perished_count", "adm_emergency_count", "personal_count", "all_violations_count", "drunk_count", "opposite_count", "not_having_count", "speed_count", "failure_to_footer_count", "belts_count", "passengers_count", "tinting_count", "footer_count", "arested_day_count", "arested_all_count", "parking_count", "article_264_1_count", "oop_count", "solved_crime_count", "stealing_autos", "theft_autos", "stealing_sloved", "theft_sloved", "stealing_sloved_gibdd", "theft_sloved_gibdd", "district_code", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"